# EDA


======================== EDA ==================================

- Pandas             :Dataframe  or data applications

- Numpy              :numerical python for math operations

- matplotlib         :for plots and graphs

- seaborn            :for plots and graphs

- bokhe              :for plots

- plotly             :for plots

#  Meachine Learning

- skilit learn(sklearn)          :ML models
- stats                          :statistical models

#  data retrival from "sql" scrapping

- sqlite                          :connect with data base
- beautiful supe                 :scrap the data from website
- websocket                      :scrap

# Deep learning/computer vision

- tensirflow             :Google
- keras                  :DL model
- opencv                 :image operation
- Pillow(pil)            :image operation 
- pytorch                :facebook
- pretrained models

    - CGG16
    - mobilenet
    - RESENT
    - RCNIN
    - MASKRCNN
    - FASTEERCNN
    - YOLO

# Natural Language process

- NLTK                   :  natural language process

- scipy

- word 2vec (how words will convert into vector

- Glove

- wordcloud

# Hugging face

- transformers            :BERT

# GenAI Models

- OpenAI+Microsoft   :  GPT Model
- Google              : Gemini
- Amazon              : Q
- Meta facebook       : MetaAI
- Apple

- LLAMA
- GEMMA
- Dalle-E
- TS
-

# LANGCHAIN

- LangChain framework

# Deployments

- Flask
- Streamlit
- Django
-

# MLops

- MLFlow
- kubeflow
- Azure AI services   : azure packages
- GCP   :GCP  packages

**step-1**

**Create a data farame**

- we will create a DataFrame using list
- we will create a DataFrame using Dictionary

In [4]:
import pandas as pd

In [7]:
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [8]:
type(d1)

pandas.core.frame.DataFrame

**Step-2**

**Provide the Data**

In [10]:
names=["tarun","surender","mohit"]
pd.DataFrame(names)

          0
0     tarun
1  surender
2     mohit

In [15]:
names=["tarun","surender","mohit"]
age=[20,25,21]
pd.DataFrame(zip(names,age))

      names  age
0     tarun   20
1  surender   25
2     mohit   21

In [14]:
names=["tarun","surender","mohit"]
age=[20,25,21]
city=["hyd","ecil","blr"]
pd.DataFrame(zip(names,age,city))

          0   1     2
0     tarun  20   hyd
1  surender  25  ecil
2     mohit  21   blr

**step-3**

**provide the columns names**

In [21]:
names=["tarun","surender","mohit"]
pd.DataFrame(names,columns=["names"])

      names
0     tarun
1  surender
2     mohit

In [20]:
names=["tarun","surender","mohit"]
age=[20,25,21]
city=["hyd","ecil","blr"]
pd.DataFrame(zip(names,age,city),columns=["names","age","city"])

      names  age  city
0     tarun   20   hyd
1  surender   25  ecil
2     mohit   21   blr

**step-4**

**providing index**

In [22]:
names=["tarun","surender","mohit"]
age=[20,25,21]
city=["hyd","ecil","blr"]
pd.DataFrame(zip(names,age,city),
             columns=["names","age","city"],        # 
             index=["A","B","C"])                   # 3 rows we need 3 index

      names  age  city
A     tarun   20   hyd
B  surender   25  ecil
C     mohit   21   blr

**step-5**

**adding new columns on existing dataframe**

In [2]:
import pandas as pd

names=["tarun","surender","mohit"]
age=[20,25,21]
city=["hyd","ecil","blr"]
df=pd.DataFrame(zip(names,age,city),
             columns=["names","age","city"],        # 
             index=["A","B","C"])
df

      names  age  city
A     tarun   20   hyd
B  surender   25  ecil
C     mohit   21   blr

- if you want to add a new column 
- first check how many rows are there
- for example im above date frame we have 3 rows
- in new column should have 3 rows
- suppose i want to create a new column called **salary**
- make a list of salary with 3 values
- salary=[100000,200000,300000]
- **syntax** : **dataframe[column]=list of values**
-

In [6]:
 salary=[100000,200000,300000]
df["salary"]=salary
df

      names  age  city  salary
A     tarun   20   hyd  100000
B  surender   25  ecil  200000
C     mohit   21   blr  300000

**use case 1**

- create a empty datafarame 
- create 3 lists using list comprehension
- list1= a values from 1 to 10
- list2= square of 1 to 10
- list3= cubes of 1 to 10
- finally make a data frame

In [7]:
import pandas as pd

In [9]:
df1=pd.DataFrame()

In [12]:
list1=[i for i in range (1,11)]
list1

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [16]:
list2=[i*i for i in range(1,11)]     # or we can also write  list2=[i**2 for i in range(1,11)]
list2

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [18]:
list3=[i*i*i for i in range(1,11)]   # or we can also write list3=[i**3 for i in range(1,11)] 
list3

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [24]:
df1=pd.DataFrame(zip(list1,list2,list3),
                 columns=["numbers","squares","cubes"],
                 index=[i for i in range(1,11)])
df1

    numbers  squares  cubes
1         1        1      1
2         2        4      8
3         3        9     27
4         4       16     64
5         5       25    125
6         6       36    216
7         7       49    343
8         8       64    512
9         9       81    729
10       10      100   1000

**Step-6**

**update the already existed column**

- create a new column 
- update the new column same only
- here also we need to make a list of values == number of rows
- creating a new column the column name is our choice
- while updating the existed column we need yo provide the existing name only
- **df["existing name"]=list of values**

In [25]:
list4=[i**4 for i in range(1,11)]
df1["cubes"]=list4
df1

    numbers  squares  cubes
1         1        1      1
2         2        4     16
3         3        9     81
4         4       16    256
5         5       25    625
6         6       36   1296
7         7       49   2401
8         8       64   4096
9         9       81   6561
10       10      100  10000

**step-7**

**how to drop a column**

In [29]:
# how to check the columns

df1.columns

Index(['numbers', 'squares', 'cubes'], dtype='object')

- if you want to drop a specific column 
- we will use drop method
- - we already know different between keywords and methods
  - keywords we use directly
  - methods will use with corresponding datafarame
  - **method=drop**

In [ ]:
- column: which column you want to drop
- Axis : Represents the specified values is a row or column
    - axis=0 means rows
    - axis=1 means columns

- inplace:  will provide overwrite the dataframe or not
-           - inplace=True,this indicates over write the datafarame
            - inplace=False, this indicates

In [36]:
df1.drop("cubes",axis=1)

# after this in a new cell type df1
#we will see the original datafarame
# because we did not provided the inplace

# if we want to

    numbers  squares
1         1        1
2         2        4
3         3        9
4         4       16
5         5       25
6         6       36
7         7       49
8         8       64
9         9       81
10       10      100

In [43]:
df2=df1.drop("squares",axis=1,inplace=True)

KeyError: "['squares'] not found in axis"